use DB39
--ΕΚΤΙΜΗΤΗΣ--
INSERT INTO Εκτιμητής(id,όνομα,επίθετο,διεύθυνση,φύλο,ηλικία)
VALUES (1004, 'Γιώργος', 'Παπαδόπουλος','Υψηλάντου 64','M', 45);

INSERT INTO Εκτιμητής(id,όνομα,επίθετο,διεύθυνση,φύλο,ηλικία)
VALUES (2306, 'Δημήτρης', 'Χρυσοστόμου','Ηρωών 82','M', 32);

INSERT INTO Εκτιμητής(id,όνομα,επίθετο,διεύθυνση,φύλο,ηλικία)
VALUES (6532, 'Ηλιάνα', 'Παπαγεωργίου','Βασιλίσσης Σοφίας 108Α','F', 35);

INSERT INTO Εκτιμητής(id,όνομα,επίθετο,διεύθυνση,φύλο,ηλικία)
VALUES (3827, 'Αθηνά', 'Χατζή','Ρεθύμνης 03','F', 50);

INSERT INTO Εκτιμητής(id,όνομα,επίθετο,διεύθυνση,φύλο,ηλικία)
VALUES (4829, 'Όλγα', 'Λέκκα','Υμμητού 80','F', 47);


--ΑΚΙΝΗΤΟ--
INSERT INTO Ακίνητο (id_ακίνητο,διεύθυνση,όροφος,μέγεθος,έτος_κατασκευής,id_περιοχή)
VALUES (14099,'Σόλωνος 77',5,92,1936,14099);

INSERT INTO Ακίνητο (id_ακίνητο,διεύθυνση,όροφος,μέγεθος,έτος_κατασκευής,id_περιοχή)
VALUES (18456,'Καρνεάδου 04',6,175,1968,14099);

INSERT INTO Ακίνητο (id_ακίνητο,διεύθυνση,όροφος,μέγεθος,έτος_κατασκευής,id_περιοχή)
VALUES (22738,'Σουηδίας 45',0,90,1977,14102);

INSERT INTO Ακίνητο (id_ακίνητο,διεύθυνση,όροφος,μέγεθος,έτος_κατασκευής,id_περιοχή)
VALUES (28573,'Μουρούζη 86',2,320,1984,14099)

INSERT INTO Ακίνητο (id_ακίνητο,διεύθυνση,όροφος,μέγεθος,έτος_κατασκευής,id_περιοχή)
VALUES (22739,'Σουηδίας 45',1,90,1977,14102);


--ΓΡΑΦΕΙΟ--
INSERT INTO Γραφείο (id_ακίνητο,ΑΦΜ)
VALUES (28573,090528809);

INSERT INTO Γραφείο (id_ακίνητο,ΑΦΜ)
VALUES (22738,044223212);


--ΚΑΤΟΙΚΙΑ--
INSERT INTO Κατοικία(id_ακίνητο,αριθμός_ταυτότητας,τύπος)
VALUES (14099,'ΑΜ38492',4);

INSERT INTO Κατοικία(id_ακίνητο,αριθμός_ταυτότητας,τύπος)
VALUES (18456,'ΑΤ30498',2);

--ΚΑΤΗΓΟΡΊΑ--
INSERT INTO Κατηγορία(ονομασία,τύπος)
VALUES ('Τριάρι',4)

INSERT INTO Κατηγορία(ονομασία,τύπος)
VALUES ('Ρετιρέ',2)

--ΕΚΤΙΜΗΣΗ--
INSERT INTO Εκτίμηση(id_εκτίμηση,ημερομηνία,τιμή,id,id_ακίνητο)
VALUES (948521,'2020-12-25',390000,1004,18456)

INSERT INTO Εκτίμηση(id_εκτίμηση,ημερομηνία,τιμή,id,id_ακίνητο)
VALUES (584983,'2020-4-2',850000,6532,14099)

INSERT INTO Εκτίμηση(id_εκτίμηση,ημερομηνία,τιμή,id,id_ακίνητο)
VALUES (485038,'2020-12-27',340000,3827,22738)

INSERT INTO Εκτίμηση(id_εκτίμηση,ημερομηνία,τιμή,id,id_ακίνητο)
VALUES (484738,'2021-11-11',380000,2306,22738)

INSERT INTO Εκτίμηση(id_εκτίμηση,ημερομηνία,τιμή,id,id_ακίνητο)
VALUES (182742,'2020-10-29',1500000,2306,22739)


--ΠΕΡΙΟΧΗ--
INSERT INTO Περιοχή(id_περιοχή,ονομασία,πληθυσμός,μέσο_εισόδημα,ανήκει)
VALUES (14099,'Κολωνάκι',52394,40000,14102);


INSERT INTO Περιοχή(id_περιοχή,ονομασία,πληθυσμός,μέσο_εισόδημα)
VALUES (14102,'Αττική',4000000);


INSERT INTO Περιοχή(id_περιοχή,ονομασία,πληθυσμός,μέσο_εισόδημα, ανήκει)
VALUES (14106,'Αθήνα',3000000,9100,14102);

--ΣΥΝΔΕΣΗ--
INSERT INTO Σύνδεση(ημερομηνία,διάρκεια,id)
VALUES ('16/11/2021',2,1004)

INSERT INTO Σύνδεση(ημερομηνία,διάρκεια,id)
VALUES ('5/11/2021',2,4829)

INSERT INTO Σύνδεση(ημερομηνία,διάρκεια,id)
VALUES ('2/11/2021',3,2306)

INSERT INTO Σύνδεση(ημερομηνία,διάρκεια,id)
VALUES ('20/11/2021',4,6532)

INSERT INTO Σύνδεση(ημερομηνία,διάρκεια,id)
VALUES ('20/11/2021',0.5,3827)

INSERT INTO Σύνδεση(ημερομηνία,διάρκεια,id)
VALUES ('16/11/2021',2,1004)

INSERT INTO Σύνδεση(ημερομηνία,διάρκεια,id)
VALUES ('18/11/2021',3,4829)

INSERT INTO Σύνδεση(ημερομηνία,διάρκεια,id)
VALUES ('21/11/2021',1,3827)

INSERT INTO Σύνδεση(ημερομηνία,διάρκεια,id)
VALUES ('24/11/2021',1,1004)

INSERT INTO Σύνδεση(ημερομηνία,διάρκεια,id)
VALUES ('15/11/2021',2,2306)

INSERT INTO Σύνδεση(ημερομηνία,διάρκεια,id)
VALUES ('16/11/2021',4,4829)